LukaJala/TELEMETRY/ReceiveTest/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM / SPIRAM (required for display frame buffer ~3MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# PSRAM power (LDO channel 2 at 1.8V for ESP32-P4)
CONFIG_ESP_LDO_CHAN_PSRAM_DOMAIN=2
CONFIG_ESP_LDO_VOLTAGE_PSRAM_1800_MV=y

# Ethernet
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# LVGL refresh at 60Hz (default 33ms = 30Hz caps the camera PiP frame rate)
CONFIG_LV_DEF_REFR_PERIOD=16

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Camera sensor driver
CONFIG_CAMERA_OV5647=y
# Full-sensor 1280x960 RAW10 2x2-binning mode (wide FOV; scaled to display via PPA)
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS=y

# DMA2D: keep operation funcs in IRAM to prevent stalls during DSI pixel
# transfers (eliminates flash cache miss latency). ISR_IRAM_SAFE must stay
# OFF: LVGL's on_job_picked callback is not in IRAM and enabling it crashes
# rendering (see CLAUDE.md).
CONFIG_DMA2D_OPERATION_FUNC_IN_IRAM=y
CONFIG_DMA2D_ISR_IRAM_SAFE=n
